content/notes/mindfulness.md
+++
title = "Mindfulness"
author = ["Alex Koen"]
lastmod = 2020-03-06T17:10:00-08:00
draft = false
+++

## Quotes {#quotes}

> “So many have allowed the contours of their existence outside of work, family obligations and school to shrink down to the comforting numbness of a screen, that it can be bracing at first to encounter the intense engagement of a life that’s lived free from passive consumption, and instead rich in so much that’s so real.”
>
> — Cal Newport

-   In his blog post [Do What You're Doing](https://www.raptitude.com/2019/11/do-what-youre-doing/), David Cain promotes the importance of being present with every task that you do, no matter how monotonous.
    -   For example, when cleaning, be present. Really feel the texture of the countertop and focus on washing the dirt off of the dishes. When you do so, you're mind will feel reinvigorated, and you may find yourself in [§Flow State.]({{< relref "20200223133836_flow_state" >}})
